app/Controllers/PostController.php

SELECT *
FROM `posts`
---
    public function index()
    {
        $data = [];
        helper(['form']);
        $postModel = new PostModel();
        $data['posts'] = $postModel->findAll();

INSERT INTO `posts` (`title`, `content`) VALUES ('safsafasdfa s', 'asdfasdfasdfasdfasdfs')
---
    public function create()
    {
          helper(['form']);
        $postModel = new PostModel();

        if ($this->request->getMethod() === 'post') {

            $rules = [
                'title' => 'required|min_length[6]|max_length[150]',
                'content' => 'required|min_length[8]|max_length[255]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => 'Title Not match'
                ]
            ];
            if (! $this->validate($rules, $errors)) {
                $data['validation'] = $this->validator;
            }else{

            $data = [
                'title' => $this->request->getPost('title'),
                'content' => $this->request->getPost('content')
            ];
            $postModel->insert($data);

SELECT *
FROM `posts`
WHERE `posts`.`id` = '12'
---
    public function edit($id)
    {
        $postModel = new PostModel();
        $data['post'] = $postModel->find($id);